api/app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("rating", "comment", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["rating", 5], ["comment", "very good application"], ["user_id", 1], ["created_at", "2023-04-28 15:32:19.799765"], ["updated_at", "2023-04-28 15:32:19.799765"]]
---
    def create
        review = Review.create!(review_params)