api/app/controllers/users_controller.rb

    def create
        user = User.create!(user_params)
---
INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "richard"], ["email", "rich@gmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2023-04-19 09:45:00.305405"], ["updated_at", "2023-04-19 09:45:00.305405"]]